In [26]:
import pandas as pd

In [3]:
df = pd.read_csv(r'/home/mitraa/Jupyter Notebook/Datascience practices/CSV files/adult data', header=None)

In [4]:
df.shape

(32561, 15)

In [5]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [6]:
df.columns = ['C'+str(x) for x in range(df.shape[1])]

In [7]:
df.columns

Index(['C0', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10',
       'C11', 'C12', 'C13', 'C14'],
      dtype='object')

In [8]:
df.loc[:,['C0','C14']]

       C0     C14
0      39   <=50K
1      50   <=50K
2      38   <=50K
3      53   <=50K
4      28   <=50K
...    ..     ...
32556  27   <=50K
32557  40    >50K
32558  58   <=50K
32559  22   <=50K
32560  52    >50K

[32561 rows x 2 columns]

In [9]:
df.head()

,C0,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,C11,C12,C13,C14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [10]:
df.tail()

,C0,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,C11,C12,C13,C14
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [11]:
L = df['C14'].unique()

In [12]:
L[0]

' <=50K'

In [13]:
L[1]

' >50K'

In [14]:
# for changing the particular column
idx = df['C14']==L[0]

In [15]:
idx

0         True
1         True
2         True
3         True
4         True
         ...
32556     True
32557    False
32558     True
32559     True
32560    False
Name: C14, Length: 32561, dtype: bool

In [27]:
#grouping (df.groupby(['col'])
df = pd.DataFrame({'ProductName':['Bulb','Bulb','Fan','Fan'],
                  'Type':['A','B','A','A'],
                  'EC':[400.,300.,250.,300.]})

In [17]:
df

  ProductName Type     EC
0        Bulb    A  400.0
1        Bulb    B  300.0
2         Fan    A  250.0
3         Fan    A  300.0

In [18]:
df.groupby(['ProductName']).sum()

                EC
ProductName
Bulb         700.0
Fan          550.0

In [19]:
df.groupby(['ProductName']).mean() #average of the groups

                EC
ProductName
Bulb         350.0
Fan          275.0

In [20]:
df.groupby([df.Type]).sum()

         EC
Type
A     950.0
B     300.0

In [23]:
df.groupby([df.ProductName, df.Type]).sum()

                     EC
ProductName Type
Bulb        A     400.0
            B     300.0
Fan         A     550.0

In [29]:
A = [['Bulb','Bulb','Bulb','Fan','Fan','Fan'],
    ['A','B','C','A','B','C']]
indx = pd.MultiIndex.from_arrays(A,names=('ProductName', 'Type'))
df = pd.DataFrame({'EC':[20,30,40,25,10,30]}, index=indx)